Revit 2026 API

# FilteredElementCollectorExcluding Method

---
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public FilteredElementCollector Excluding(
	ICollection<ElementId> idsToExclude
)
```
```vb
Public Function Excluding (
	idsToExclude As ICollection(Of ElementId)
) As FilteredElementCollector
```
```cpp
public:
FilteredElementCollector^ Excluding(
	ICollection<ElementId^>^ idsToExclude
)
```
```fsharp
member Excluding :
        idsToExclude : ICollection<ElementId> -> FilteredElementCollector
```

#### Parameters

idsToExclude ICollectionElementId

#### Return Value

FilteredElementCollector

#### Reference

FilteredElementCollector Class

Autodesk.Revit.DB Namespace